# RebarCrankOverridableParameters Properties

---
The RebarCrankOverridableParameters type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
RebarCrankOverridableParameters Class
Autodesk.Revit.DB.Structure Namespace